ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/mpu.xml
<module id="MPU" HW_revision=""><register id="TYPE_" width="32" offset="0xD90" internal="0" description="MPU Type Register"><bitfield id="SEPARATE" description="Because the processor core uses only a unified MPU, SEPARATE is" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="DREGION" description="Number of supported MPU regions field" begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="IREGION" description="Because the processor core uses only a unified MPU, IREGION alw" begin="23" end="16" width="8" rwaccess="R/W"/></register><register id="CTRL_" width="32" offset="0xD94" internal="0" description="MPU Control Register"><bitfield id="ENABLE" description="MPU enable bit. Reset clears the ENABLE bit." begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="ENABLE__0" value="0x0" description="disable MPU"/><bitenum id="ENABLE__1" value="0x1" description="enable MPU"/></bitfield><bitfield id="HFNMIENA" description="This bit enables the MPU when in Hard Fault, NMI, and FAULTMASK" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="PRIVDEFENA" description="This bit enables the default memory map for privileged access, " begin="2" end="2" width="1" rwaccess="R/W"/></register><register id="RNR_" width="32" offset="0xD98" internal="0" description="MPU Region Number Register"><bitfield id="REGION" description="Region select field" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="RBAR_" width="32" offset="0xD9C" internal="0" description="MPU Region Base Address Register"><bitfield id="REGION" description="MPU region override field." begin="3" end="0" width="4" rwaccess="R/W"/><bitfield id="VALID" description="MPU Region Number valid bit." begin="4" end="4" width="1" rwaccess="R/W"><bitenum id="VALID__0" value="0x0" description="MPU Region Number Register remains unchanged and is interpreted."/><bitenum id="VALID__1" value="0x1" description="MPU Region Number Register is overwritten by bits 3:0 (the REGI"/></bitfield><bitfield id="ADDR" description="Region base address field" begin="31" end="5" width="27" rwaccess="R/W"/></register><register id="RASR_" width="32" offset="0xDA0" internal="0" description="MPU Region Attribute and Size Register"><bitfield id="ENABLE" description="Region enable bit." begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="SIZE" description="MPU Protection Region Size Field." begin="5" end="1" width="5" rwaccess="R/W"><bitenum id="SIZE__0" value="0x0" description="4KB"/><bitenum id="SIZE__1" value="0x1" description="256MB"/><bitenum id="SIZE__4" value="0x04" description="32B"/><bitenum id="SIZE__5" value="0x05" description="64B"/><bitenum id="SIZE__6" value="0x06" description="128B"/><bitenum id="SIZE__7" value="0x07" description="256B"/><bitenum id="SIZE__8" value="0x08" description="512B"/><bitenum id="SIZE__9" value="0x09" description="1KB"/><bitenum id="SIZE__10" value="0x0A" description="2KB"/><bitenum id="SIZE__12" value="0x0C" description="8KB"/><bitenum id="SIZE__13" value="0x0D" description="16KB"/><bitenum id="SIZE__14" value="0x0E" description="32KB"/><bitenum id="SIZE__15" value="0x0F" description="64KB"/><bitenum id="SIZE__16" value="0x10" description="128KB"/><bitenum id="SIZE__17" value="0x11" description="256KB"/><bitenum id="SIZE__18" value="0x12" description="512KB"/><bitenum id="SIZE__19" value="0x13" description="1MB"/><bitenum id="SIZE__20" value="0x14" description="2MB"/><bitenum id="SIZE__21" value="0x15" description="4MB"/><bitenum id="SIZE__22" value="0x16" description="8MB"/><bitenum id="SIZE__23" value="0x17" description="16MB"/><bitenum id="SIZE__24" value="0x18" description="32MB"/><bitenum id="SIZE__25" value="0x19" description="64MB"/><bitenum id="SIZE__26" value="0x1A" description="128MB"/><bitenum id="SIZE__28" value="0x1C" description="512MB"/><bitenum id="SIZE__29" value="0x1D" description="1GB"/><bitenum id="SIZE__30" value="0x1E" description="2GB"/><bitenum id="SIZE__31" value="0x1F" description="4GB"/></bitfield><bitfield id="SRD" description="Sub-Region Disable (SRD) field" begin="15" end="8" width="8" rwaccess="R/W"/><bitfield id="B" description="Bufferable bit" begin="16" end="16" width="1" rwaccess="R/W"><bitenum id="B__0" value="0x0" description="not bufferable"/><bitenum id="B__1" value="0x1" description="bufferable"/></bitfield><bitfield id="C" description="Cacheable bit" begin="17" end="17" width="1" rwaccess="R/W"><bitenum id="C__0" value="0x0" description="not cacheable"/><bitenum id="C__1" value="0x1" description="cacheable"/></bitfield><bitfield id="S" description="Shareable bit" begin="18" end="18" width="1" rwaccess="R/W"><bitenum id="S__0" value="0x0" description="not shareable"/><bitenum id="S__1" value="0x1" description="shareable"/></bitfield><bitfield id="TEX" description="Type extension field" begin="21" end="19" width="3" rwaccess="R/W"/><bitfield id="AP" description="Data access permission field" begin="26" end="24" width="3" rwaccess="R/W"><bitenum id="AP__0" value="0x0" description="Priviliged permissions: No access. User permissions: No access."/><bitenum id="AP__1" value="0x1" description="Priviliged permissions: Read-write. User permissions: No access."/><bitenum id="AP__2" value="0x2" description="Priviliged permissions: Read-write. User permissions: Read-only."/><bitenum id="AP__3" value="0x3" description="Priviliged permissions: Read-write"/><bitenum id="AP__5" value="0x5" description="Priviliged permissions: Read-only. User permissions: No access."/><bitenum id="AP__6" value="0x6" description="Priviliged permissions: Read-only. User permissions: Read-only."/><bitenum id="AP__7" value="0x7" description="Priviliged permissions: Read-only. User permissions: Read-only."/></bitfield><bitfield id="XN" description="Instruction access disable bit" begin="28" end="28" width="1" rwaccess="R/W"><bitenum id="XN__0" value="0x0" description="enable instruction fetches"/><bitenum id="XN__1" value="0x1" description="disable instruction fetches"/></bitfield></register><register id="RBAR_A1_" width="32" offset="0xDA4" internal="0" description="MPU Alias 1 Region Base Address register"/><register id="RASR_A1_" width="32" offset="0xDA8" internal="0" description="MPU Alias 1 Region Attribute and Size register"/><register id="RBAR_A2_" width="32" offset="0xDAC" internal="0" description="MPU Alias 2 Region Base Address register"/><register id="RASR_A2_" width="32" offset="0xDB0" internal="0" description="MPU Alias 2 Region Attribute and Size register"/><register id="RBAR_A3_" width="32" offset="0xDB4" internal="0" description="MPU Alias 3 Region Base Address register"/><register id="RASR_A3_" width="32" offset="0xDB8" internal="0" description="MPU Alias 3 Region Attribute and Size register"/></module>